[ABB_Scout X2SoldierClassTemplate]
DisplayName="Scout"
ClassSummary="Scouts are a fast class that can get vision on enemies. Aside from using their own sniper or assault rifle, they can support their squad by marking potential targets and exposing their weak points."
LeftAbilityTreeTitle="Scout"
RightAbilityTreeTitle="Operative"
AbilityTreeTitles[0]="Scout"
AbilityTreeTitles[1]="Operative"
AbilityTreeTitles[2]="Operative"
AbilityTreeTitles[3]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="Apex"
RandomNickNames[1]="Ace"
RandomNickNames[2]="Aftermath"
RandomNickNames[3]="Alpha"
RandomNickNames[4]="Blackjack"
RandomNickNames[5]="Bullseye"
RandomNickNames[6]="Bolt"
RandomNickNames[7]="Big Shot"
RandomNickNames[8]="Big Sleep"
RandomNickNames[9]="Big Time"
RandomNickNames[10]="Boss"
RandomNickNames[11]="Bullseye"
RandomNickNames[12]="Checkmate"
RandomNickNames[13]="Chief"
RandomNickNames[14]="Colt"
RandomNickNames[15]="Dallas"
RandomNickNames[16]="Deadbolt"
RandomNickNames[17]="Deadeye"
RandomNickNames[18]="Deadlock"
RandomNickNames[19]="Deadwood"
RandomNickNames[20]="D.O.A."
RandomNickNames[21]="Eagle Eye"
RandomNickNames[22]="Eight Ball"
RandomNickNames[23]="Flatline"
RandomNickNames[24]="Game Time"
RandomNickNames[25]="Gangster"
RandomNickNames[26]="Grave Digger"
RandomNickNames[27]="Hat Trick"
RandomNickNames[28]="Hawkeye"
RandomNickNames[29]="Heater"
RandomNickNames[30]="High Noon"
RandomNickNames[31]="Hitman"
RandomNickNames[32]="Hollywood"
RandomNickNames[33]="Hype"
RandomNickNames[34]="Icon"
RandomNickNames[35]="Jackal"
RandomNickNames[36]="Judge"
RandomNickNames[37]="Lights Out"
RandomNickNames[38]="Lockdown"
RandomNickNames[39]="Long Shot"
RandomNickNames[40]="Longwalker"
RandomNickNames[41]="Needle"
RandomNickNames[42]="Pale Rider"
RandomNickNames[43]="Huntsman"
RandomNickNames[44]="Scratch"
RandomNickNames[45]="Serial"
RandomNickNames[46]="Sheriff"
RandomNickNames[47]="Shooter"
RandomNickNames[48]="Showtime"
RandomNickNames[49]="Slick"
RandomNickNames[50]="Slinger"
RandomNickNames[51]="Stonecold"
RandomNickNames[52]="The Cleaner"
RandomNickNames[53]="The Kid"
RandomNickNames[54]="The Truth"
RandomNickNames[55]="Tombstone"
RandomNickNames[56]="Top Notch"
RandomNickNames[57]="Top Shelf"
RandomNickNames[58]="Two Tap"
RandomNickNames[59]="Undertaker"
RandomNickNames[60]="Valentine"
;ALPHABETICAL ORDER
RandomNicknames_Male[0]="Cowboy"
RandomNickNames_Male[1]="Godfather"
RandomNickNames_Male[2]="Mailman"
RandomNickNames_Male[3]="Sandman"
RandomNickNames_Male[4]="Slim"
RandomNickNames_Male[5]="Taxman"
RandomNickNames_Male[6]="Zeus"
RandomNickNames_Female[0]="Baroness"
RandomNickNames_Female[1]="Black Widow"
RandomNicknames_Female[2]="Calamity"
RandomNicknames_Female[3]="Queen Bee"
;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="Death From Afar"
PhotoboothSoloBLines_Male[1]="Go Ahead and Run. You'll Just Die Tired."
PhotoboothSoloBLines_Male[2]="King of Killshots"
PhotoboothSoloBLines_Male[3]="Right Between Their Alien Eyes"
PhotoboothSoloBLines_Male[4]="The Only Thing He Feels is Recoil"
PhotoboothSoloBLines_Male[5]="One shot, one kill."
PhotoboothSoloBLines_Male[6]="One shot, one kill. No luck, all skill."
PhotoboothSoloBLines_Male[7]="Patience is bitter, but its fruit is sweet."
PhotoboothSoloBLines_Male[8]="Guaranteed delivery."
PhotoboothSoloBLines_Male[9]="Save bullets.  Use a sniper."

PhotoboothSoloBLines_Female[0]="Death From Afar"
PhotoboothSoloBLines_Female[1]="Go Ahead and Run. You'll Just Die Tired."
PhotoboothSoloBLines_Female[2]="Queen of Killshots"
PhotoboothSoloBLines_Female[3]="Right Between Their Alien Eyes"
PhotoboothSoloBLines_Female[4]="The Only Thing She Feels is Recoil"
PhotoboothSoloBLines_Female[5]="One shot, one kill."
PhotoboothSoloBLines_Female[6]="One shot, one kill. No luck, all skill."
PhotoboothSoloBLines_Female[7]="Patience is bitter, but its fruit is sweet."
PhotoboothSoloBLines_Female[8]="Guaranteed delivery."
PhotoboothSoloBLines_Female[9]="Save bullets.  Use a sniper."
